package com.mnnyang.data.bean;

import java.util.List;

/**
 * Created by mnnyang on 17-10-4.
 */

public class DayArticle {

    /**
     * code : 200
     * message : success
     * data : [{"id":"1","a_c_id":"1","date":"2017-10-03","collect":"0","praise":"0","title":"背影","author":"朱自清","from":"1925.10","content":"　　我与父亲不相见已二年余了，我最不能忘记的是他的背影。那年冬天，祖母死了，父亲的差使也交卸了，正是祸不单行的日子，我从北京到徐州，打算跟着父亲奔丧回家。到徐州见着父亲，看见满院狼藉的东西，又想起祖母，不禁簌簌地流下眼泪。父亲说，\u201c事已如此，不必难过，好在天无绝人之路！\u201d 　　回家变卖典质，父亲还了亏空；又借钱办了丧事。这些日子，家中光景很是惨淡，一半为了丧事，一半为了父亲赋闲。丧事完毕，父亲要到南京谋事，我也要回北京念书，我们便同行。 　　到南京时，有朋友约去游逛，勾留了一日；第二日上午便须渡江到浦口，下午上车北去。父亲因为事忙，本已说定不送我，叫旅馆里一个熟识的茶房陪我同去。他再三嘱咐茶房，甚是仔细。但他终于不放心，怕茶房不妥帖；颇踌躇了一会。其实我那年已二十岁，北京已来往过两三次，是没有甚么要紧的了。他踌躇了一会，终于决定还是自己送我去。我两三回劝他不必去；他只说，\u201c不要紧，他们去不好！\u201d 　　我们过了江，进了车站。我买票，他忙着照看行李。行李太多了，得向脚夫行些小费，才可过去。他便又忙着和他们讲价钱。我那时真是聪明过分，总觉他说话不大漂亮，非自己插嘴不可。但他终于讲定了价钱；就送我上车。他给我拣定了靠车门的一张椅子；我将他给我做的紫毛大衣铺好坐位。他嘱我路上小心，夜里警醒些，不要受凉。又嘱托茶房好好照应我。我心里暗笑他的迂；他们只认得钱，托他们直是白托！而且我这样大年纪的人，难道还不能料理自己么？唉，我现在想想，那时真是太聪明了！ 　　我说道，\u201c爸爸，你走吧。\u201d他望车外看了看，说，\u201c我买几个橘子去。你就在此地，不要走动。\u201d我看那边月台的栅栏外有几个卖东西的等着顾客。走到那边月台，须穿过铁道，须跳下去又爬上去。父亲是一个胖子，走过去自然要费事些。我本来要去的，他不肯，只好让他去。我看见他戴着黑布小帽，穿着黑布大马褂，深青布棉袍，蹒跚地走到铁道边，慢慢探身下去，尚不大难。可是他穿过铁道，要爬上那边月台，就不容易了。他用两手攀着上面，两脚再向上缩；他肥胖的身子向左微倾，显出努力的样子。这时我看见他的背影，我的泪很快地流下来了。我赶紧拭干了泪，怕他看见，也怕别人看见。我再向外看时，他已抱了朱红的橘子望回走了。过铁道时，他先将橘子散放在地上，自己慢慢爬下，再抱起橘子走。到这边时，我赶紧去搀他。他和我走到车上，将橘子一股脑儿放在我的皮大衣上。于是扑扑衣上的泥土，心里很轻松似的，过一会说，\u201c我走了；到那边来信！\u201d我望着他走出去。他走了几步，回过头看见我，说，\u201c进去吧，里边没人。\u201d等他的背影混入来来往往的人里，再找不着了，我便进来坐下，我的眼泪又来了。 　　近几年来，父亲和我都是东奔西走，家中光景是一日不如一日。他少年出外谋生，独力支持，做了许多大事。那知老境却如此颓唐！他触目伤怀，自然情不能自已。情郁于中，自然要发之于外；家庭琐屑便往往触他之怒。他待我渐渐不同往日。但最近两年的不见，他终于忘却我的不好，只是惦记着我，惦记着我的儿子。我北来后，他写了一信给我，信中说道，\u201c我身体平安，惟膀子疼痛利害，举箸提笔，诸多不便，大约大去之期不远矣。\u201d我读到此处，在晶莹的泪光中，又看见那肥胖的，青布棉袍，黑布马褂的背影。唉！我不知何时再能与他相见！ "},{"id":"2","a_c_id":"2","date":"2017-10-04","collect":"0","praise":"0","title":"故都的秋","author":"郁达夫","from":"","content":"　　秋天，无论在什么地方的秋天，总是好的;可是啊，北国的秋，却特别地来得清，来得静，来得悲凉。我的不远千里，要从杭州赶上青岛，更要从青岛赶上北平来的理由，也不过想饱尝一尝这\u201c秋\u201d，这故都的秋味。 　　江南，秋当然也是有的，但草木凋得慢，空气来得润，天的颜色显得淡，并且又时常多雨而少风;一个人夹在苏州上海杭州，或厦门香港广州的市民中间，混混沌沌地过去，只能感到一点点清凉，秋的味，秋的色，秋的意境与姿态，总看不饱，尝不透，赏玩不到十足。秋并不是名花，也并不是美酒，那一种半开、半醉的状态，在领略秋的过程上，是不合适的。 　　不逢北国之秋，已将近十余年了。在南方每年到了秋天，总要想起陶然亭的芦花，钓鱼台的柳影，西山的虫唱，玉泉的夜月，潭柘寺的钟声。在北平即使不出门去吧，就是在皇城人海之中，租人家一椽破屋来住着，早晨起来，泡一碗浓茶，向院子一坐，你也能看得到很高很高的碧绿的天色，听得到青天下驯鸽的飞声。从槐树叶底，朝东细数着一丝一丝漏下来的日光，或在破壁腰中，静对着像喇叭似的牵牛花(朝荣)的蓝朵，自然而然地也能够感觉到十分的秋意。说到了牵牛花，我以为以蓝色或白色者为佳，紫黑色次之，淡红色最下。最好，还要在牵牛花底，教长着几根疏疏落落的尖细且长的秋草，使作陪衬。 　　北国的槐树，也是一种能便人联想起秋来的点辍。像花而又不是花的那一种落蕊，早晨起来，会铺得满地。脚踏上去，声音也没有，气味也没有，只能感出一点点极微细极柔软的触觉。扫街的在树影下一阵扫后，灰土上留下来的一条条扫帚的丝纹，看起来既觉得细腻，又觉得清闲，潜意识下并且还觉得有点儿落寞，古人所说的梧桐一叶而天下知秋的遥想，大约也就在这些深沉的地方。 　　秋蝉的衰弱的残声，更是北国的特产，因为北平处处全长着树，屋子又低，所以无论在什么地方，都听得见它们的啼唱。在南方是非要上郊外或山上去才听得到的。这秋蝉的嘶叫，在北方可和蟋蟀耗子一样，简直像是家家户户都养在家里的家虫。 　　还有秋雨哩，北方的秋雨，也似乎比南方的下得奇，下得有味，下得更像样。 　　在灰沉沉的天底下，忽而来一阵凉风，便息列索落地下起雨来了。一层雨过，云渐渐地卷向了西去，天又晴了，太阳又露出脸来了，着着很厚的青布单衣或夹袄的都市闲人，咬着烟管，在雨后的斜桥影里，上桥头树底下去一立，遇见熟人，便会用了缓慢悠闲的声调，微叹着互答着地说： 　　\u201c唉，天可真凉了-----\u201d(这了字念得很高，拖得很长。) 　　\u201c可不是吗?一层秋雨一层凉了!\u201d 　　北方人念阵字，总老像是层字，平平仄仄起来，这念错的歧韵，倒来得正好。 　　北方的果树，到秋天，也是一种奇景。第一是枣子树，屋角，墙头，茅房边上，灶房门口，它都会一株株地长大起来。像橄榄又像鸽蛋似的这枣子颗儿，在小椭圆形的细叶中间，显出淡绿微黄的颜色的时候，正是秋的全盛时期，等枣树叶落，枣子红完，西北风就要起来了，北方便是沙尘灰土的世界，只有这枣子、柿子、葡萄，成熟到八九分的七八月之交，是北国的清秋的佳日，是一年之中最好也没有的Golden Days。 　　有些批评家说，中国的文人学士，尤其是诗人，都带着很浓厚的颓废的色彩，所以中国的诗文里，赞颂秋的文字的特别的多。但外国的诗人，又何尝不然?我虽则外国诗文念的不多，也不想开出帐来，做一篇秋的诗歌散文钞，但你若去一翻英德法意等诗人的集子，或各国的诗文的Anthology来，总能够看到许多并于秋的歌颂和悲啼。各著名的大诗人的长篇田园诗或四季诗里，也总以关于秋的部分。写得最出色而最有味。足见有感觉的动物，有情趣的人类，对于秋，总是一样地特别能引起深沉，幽远、严厉、萧索的感触来的。不单是诗人，就是被关闭在牢狱里的囚犯，到了秋天，我想也一定能感到一种不能自己的深情，秋之于人，何尝有国别，更何尝有人种阶级的区别呢?不过在中国，文字里有一个\u201c秋士\u201d的成语，读本里又有着很普遍的欧阳子的《秋声》与苏东坡的《赤壁赋》等，就觉得中国的文人，与秋和关系特别深了，可是这秋的深味，尤其是中国的秋的深味，非要在北方，才感受得到底。 　　南国之秋，当然也是有它的特异的地方的，比如甘四桥的明月，钱塘江的秋潮，普陀山的凉雾，荔枝湾的残荷等等，可是色彩不浓，回味不永。比起北国的秋来，正像是黄河之与白干，稀饭之与馍馍，鲈鱼之与大蟹，黄犬之与骆驼。 　　秋天，这北国的秋天，若留得住的话，我愿把寿命的三分之二折去，换得一个三分之一的零头。"},{"id":"3","a_c_id":"3","date":"2017-10-05","collect":"0","praise":"0","title":"消失的母校","author":"乔显德","from":"","content":"每个上过学的人都有自己的母校，这个母校让人魂牵梦绕。前几日参加老师女儿的婚礼，一个很要好的同学若有所思地说：\u201c我现在一个母校也没有了。\u201d他的话好似发来了心有灵犀一样的信息，我心有所悟，立即应道：\u201c噢，咱俩一样，我也没有了母校。\u201d后来，我细细琢磨，便觉若有所失，黯然失色，惆怅不已，还好像有那么一点点酸楚的感觉，这种酸酸的情愫诱使着我的笔触写一写一一消失了的母校。 母校，多么圣洁而美好的字眼。那是每一位莘莘学子知识的摇篮，是踏入人生大舞台的重要排练场；是装在学子心中的灯塔，照亮学子们的前程；是装在学子脑中的储存器，承载着学子们的青春记忆。古往今来，每一个从母校走出去的人，文人圣哲也好，普通学子也罢，每每提起母校，都怀有深深的感情，这种感情是其他感情无与伦比的，因这种感情甚而泪流满面。因为，那是把人生的许多美好时光都倾注在这里的地方，那是把我们从稚嫩的树苗培养成参天大树的苗圃，辛勤地园丁浇灌着我们在这里茁壮成长。母校曾让几多人留恋，曾让几多人向往；也曾让几多人朝思暮想。即使毕业多年，每每路过母校，总想多看两眼；即使客居海外，每每提到母校，总想多说些话，多些思念，更把母校装在梦里。 我起初的母校是在村子西头的一个3间厢房里，坐东朝西，据说这是解放前大户人家的房子归公的。这里可以说是真正意义的母校，母校的名称是\u201c乔家小学\u201d，座落在乔家村的土地上，都是乔家村土生土长的教师任教，有一位还是我本家的四婶，这样的母校就更像是母校了。这让我想起了一首校园歌曲：\u201c沿着校园熟悉的小路，清晨来到树下读书，初升的太阳照在脸上，也照在身旁这棵小树\u2026\u2026\u201d多么形象啊！我当时就是这样，迎着初升的太阳走进教室，迎着落日的余晖走出教室，整日在温馨的母校里。我的学业从这里起步，\u201c万丈高楼平地起\u201d，我从读书时的\u201c毛主席万岁\u2026\u2026\u201d，从写字时的\u201c先横后竖、先撇后捺\u2026\u2026\u201d，从数字时的\u201c123456789\u2026\u2026\u201d，从拼音时的\u201cbpmfdtnl\u2026\u2026\u201d一一学起，这些都成为日后事业的基石和敲门砖。现在想来，母校，可以说是人生起步的地方，它使每个人今生难忘。我现在还依稀记得，上课前优美的歌声，上课中朗朗的读书声，课后不断的欢笑声，响彻在母校的上空，形成了欢快的旋律。还有，在这难忘的校园里，留下了我喊队列时的自豪；留下了我演\u201c小老头\u201d的荣耀；留下了我手握红缨枪的英豪；留下了老贫农的苦难辛酸史；留下了\u201c五虎将\u201d的抗战史；还留下了我五彩斑斓的梦\u2026\u2026\u201d 我初中时的母校是在村子西北边，是联合办学建立的中学，所以就叫\u201c乔家联中\u201d。在空旷的操场山，我们一级级学生白手起家，在那个\u201c半工半读\u201d、\u201c勤工俭学\u201d的年代里，凭着我们一双双手，建起了美丽的校园，石头是我们从自己山上推的，砖是我们自己运的，瓦是我们用勤工俭学的钱买的，就连校舍也是我们给乡村匠人当小工盖起来的，在这自己亲手建起来的母校里感到亲切，学习踏实，锻炼舒畅。运动场上，留下了我们矫健的身影，教室里，留下了我们默默读书、学习的情景。虽在\u201c白卷英雄\u201d、\u201c白专道路\u201d盛行的年代，我们没学到多少知识，但一想到自己亲手建起来的学校，我心爱的母校，心中就有一股股暖流在涌动，这是母校的情结使然。 我最后的母校是在乡镇驻地附近，在享有风景名胜区之称的双庙水库前面，一排排红砖黛瓦的校舍矗立在校园内，一行行白杨树参天而长，一群群学子青春激荡，内心承载着自己的梦想。母校给我留下了很深的印象，我时常在想，与漫漫的历史长河相比，人生只是短暂的一瞬，而在这短暂的人生之中，当时两年的高中生活又似乎显得微不足道。然而，这两年的高中生活在我的人生旅途中占据着重要位置，那种师生情、同学缘藏匿在我的灵魂深处，时常触动我思想的火花，撞击着我的心灵。 特别令人难忘的是，时值刚刚粉碎\u201c四人帮\u201d的年代，全国百废待兴，在遭遇了\u201c知识越多越反动\u201d、大树特树\u201c白卷英雄\u201d之后，教育拨乱反正，恢复高考制度，当年全国就有270万人参加高考，带来的是教育界的万物复苏。老师们都上紧了\u201c发条\u201d，学生们都鼓足了劲。刚刚升入高中的我们，才品尝到了知识的甘甜。于是乎，白日里，我们刻苦攻读，认真细心地听着老师们讲课；晚自习时，我们\u201c挑灯夜战\u201d；晚自习熄灯后，我们一个个像夜猫子一样，还要宿舍里端着一盏盏像萤火虫似的煤油灯，重回教室，搞起了\u201c题海战术\u201d，熬夜苦读，就是为了实现高考的梦想。在教与学的深度磨合中，更缔结了师生情谊，这才是在拼搏中开出的友谊之花。我仍记得老校长郭立兴在绿树成荫下的谆谆教诲；数学老师金荣臻的严格要求；化学老师尚桂萍的循循善诱；语文老师冷炳志的慷慨激昂\u2026\u2026尽管老师们像辛勤的园丁一样付出了，我们也如临阵磨刀的士兵一样拼上了，然而，那可怜的4%升学率，却把我们拒之于高等学府大门之外。 现在想来，虽说我们没有实现老师的愿望和自己的理想，但我们收获了那极不寻常的师生、同学情谊，这是任何东西换不来的宝贵精神财富，弥足珍贵。我们不惜的是，我们曾在这里奋斗过，这就足矣；我们感到欣慰的是，母校就是陪伴支撑我们为梦想而奋斗的地方，这是有着文化底蕴的地方，这样的地方怎能忘？ 然而，我记忆中的母校在一个个消失，记得上世纪八十年代，初中母校消失了，村子小学搬进了母校校园；到了上世纪九十年代，小学母校也消失了，留下了荒芜的校园；历史进入新千年后，高中母校也消失了，取而代之的是一座座房产大楼。 母校，无论是否著名，无论有无悠久历史，在莘莘学子心中都是一样的，我们追寻的不是学校的名望，而是珍贵的校园记忆和美好的青春时光。操场上的相互竞赛、同桌的三八线纷争、严厉的老师、天真的同学、校园的一草一木\u2026\u2026所有这一切，都是我们的青春印记。还有，我们的奋斗、成长、进步，都与母校的栽培息息相关。遗憾的是，许多人的母校一一消失了，都发出了\u201c母校在哪里？\u201d的叹息。 我现实的母校一一消失了，而我心中的母校一一耸立着，将永远耸立在我心中，因为那里承载着我永远抹不掉的青春记忆。"}]
     */

    private int code;
    private String message;
    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * id : 1
         * a_c_id : 1
         * date : 2017-10-03
         * collect : 0
         * praise : 0
         * title : 背影
         * author : 朱自清
         * from : 1925.10
         * content : 　　我与父亲不相见已二年余了，我最不能忘记的是他的背影。那年冬天，祖母死了，父亲的差使也交卸了，正是祸不单行的日子，我从北京到徐州，打算跟着父亲奔丧回家。到徐州见着父亲，看见满院狼藉的东西，又想起祖母，不禁簌簌地流下眼泪。父亲说，“事已如此，不必难过，好在天无绝人之路！” 　　回家变卖典质，父亲还了亏空；又借钱办了丧事。这些日子，家中光景很是惨淡，一半为了丧事，一半为了父亲赋闲。丧事完毕，父亲要到南京谋事，我也要回北京念书，我们便同行。 　　到南京时，有朋友约去游逛，勾留了一日；第二日上午便须渡江到浦口，下午上车北去。父亲因为事忙，本已说定不送我，叫旅馆里一个熟识的茶房陪我同去。他再三嘱咐茶房，甚是仔细。但他终于不放心，怕茶房不妥帖；颇踌躇了一会。其实我那年已二十岁，北京已来往过两三次，是没有甚么要紧的了。他踌躇了一会，终于决定还是自己送我去。我两三回劝他不必去；他只说，“不要紧，他们去不好！” 　　我们过了江，进了车站。我买票，他忙着照看行李。行李太多了，得向脚夫行些小费，才可过去。他便又忙着和他们讲价钱。我那时真是聪明过分，总觉他说话不大漂亮，非自己插嘴不可。但他终于讲定了价钱；就送我上车。他给我拣定了靠车门的一张椅子；我将他给我做的紫毛大衣铺好坐位。他嘱我路上小心，夜里警醒些，不要受凉。又嘱托茶房好好照应我。我心里暗笑他的迂；他们只认得钱，托他们直是白托！而且我这样大年纪的人，难道还不能料理自己么？唉，我现在想想，那时真是太聪明了！ 　　我说道，“爸爸，你走吧。”他望车外看了看，说，“我买几个橘子去。你就在此地，不要走动。”我看那边月台的栅栏外有几个卖东西的等着顾客。走到那边月台，须穿过铁道，须跳下去又爬上去。父亲是一个胖子，走过去自然要费事些。我本来要去的，他不肯，只好让他去。我看见他戴着黑布小帽，穿着黑布大马褂，深青布棉袍，蹒跚地走到铁道边，慢慢探身下去，尚不大难。可是他穿过铁道，要爬上那边月台，就不容易了。他用两手攀着上面，两脚再向上缩；他肥胖的身子向左微倾，显出努力的样子。这时我看见他的背影，我的泪很快地流下来了。我赶紧拭干了泪，怕他看见，也怕别人看见。我再向外看时，他已抱了朱红的橘子望回走了。过铁道时，他先将橘子散放在地上，自己慢慢爬下，再抱起橘子走。到这边时，我赶紧去搀他。他和我走到车上，将橘子一股脑儿放在我的皮大衣上。于是扑扑衣上的泥土，心里很轻松似的，过一会说，“我走了；到那边来信！”我望着他走出去。他走了几步，回过头看见我，说，“进去吧，里边没人。”等他的背影混入来来往往的人里，再找不着了，我便进来坐下，我的眼泪又来了。 　　近几年来，父亲和我都是东奔西走，家中光景是一日不如一日。他少年出外谋生，独力支持，做了许多大事。那知老境却如此颓唐！他触目伤怀，自然情不能自已。情郁于中，自然要发之于外；家庭琐屑便往往触他之怒。他待我渐渐不同往日。但最近两年的不见，他终于忘却我的不好，只是惦记着我，惦记着我的儿子。我北来后，他写了一信给我，信中说道，“我身体平安，惟膀子疼痛利害，举箸提笔，诸多不便，大约大去之期不远矣。”我读到此处，在晶莹的泪光中，又看见那肥胖的，青布棉袍，黑布马褂的背影。唉！我不知何时再能与他相见！
         */

        private String id;
        private String a_c_id;
        private String date;
        private String collect;
        private String praise;
        private String title;
        private String author;
        private String from;
        private String content;

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getA_c_id() {
            return a_c_id;
        }

        public void setA_c_id(String a_c_id) {
            this.a_c_id = a_c_id;
        }

        public String getDate() {
            return date;
        }

        public void setDate(String date) {
            this.date = date;
        }

        public String getCollect() {
            return collect;
        }

        public void setCollect(String collect) {
            this.collect = collect;
        }

        public String getPraise() {
            return praise;
        }

        public void setPraise(String praise) {
            this.praise = praise;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getFrom() {
            return from;
        }

        public void setFrom(String from) {
            this.from = from;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }
    }
}
